app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all

SELECT * FROM "events" WHERE ("events"."id" = 7)
UPDATE "events" SET "updated_at" = '2009-11-05 04:45:23', "description" = 'Lorem Ipsum Dolore' WHERE "id" = 7
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])