app/controllers/signup_controller.rb

SELECT "events".id FROM "events" WHERE ("events"."key" = 'turkey') LIMIT 1
---
  def index
    event_key = params[:id] || session[:event]
    logger.debug(event_key)
    if Event.exists?(:key => event_key)

SELECT * FROM "events" WHERE ("events"."key" = 'turkey') LIMIT 1
SELECT * FROM "contributions" WHERE ("contributions".item_id = 4)
SELECT "items".id FROM "items" WHERE ("items"."id" = '22' AND "items"."event_id" = 7) LIMIT 1
---
  def create
    # Make sure we know which event we are working with
    render :action => "not_found" unless session[:event]
    # Protect from direct creates
    if request.get?
      redirect_to :action => "index", :id => session[:event]
      return
    end

    # Verify event
    @event = Event.find_by_key(session[:event])
    # Setup objects
    @contributor = Contributor.new(params[:contributor])
    # Validate request
    @contributor.name.empty? and @event.errors.add_to_base 'Please enter your name.'
    if @contributor.email.empty?
      @event.errors.add_to_base 'Please enter your email.'
    else
      unless @contributor.email =~ /\A([^@\s]+)@((?:[-a-z0-9]+\.)+[a-z]{2,})\Z/i
        @event.errors.add_to_base 'Please enter a valid email.'
      end
    end

    count = 0
    params[:contributions].each do |item_id, data|
      unless data[:quantity].nil? or data[:quantity].empty?
        unless data[:quantity].to_i >= 0
          i = Item.find(item_id, :conditions => "event_id = #{@event.id}")

INSERT INTO "contributions" ("contributor_id", "created_at", "quantity", "updated_at", "note", "item_id") VALUES(18, '2009-11-05 04:21:19', 1, '2009-11-05 04:21:19', 'test note', 22)
INSERT INTO "contributors" ("name", "created_at", "updated_at", "email") VALUES('a', '2009-11-05 04:21:19', '2009-11-05 04:21:19', 'a@a.com')
---
              else
                qty = data[:quantity]
              end
              @item.contributions << Contribution.new(:contributor => @contributor, :quantity => qty, :note => data[:note])